#pragma once

// RogueCompany (4.24) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Serialization.StructSerializerTestStruct
// 0x5B0CE500
struct FStructSerializerTestStruct
{
	unsigned char                                      UnknownData00[0x5B0CE500];                                // 0x0000(0x5B0CE500) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerSetTestStruct
// 0x5B093F80
struct FStructSerializerSetTestStruct
{
	unsigned char                                      UnknownData00[0x5B093F80];                                // 0x0000(0x5B093F80) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerBuiltinTestStruct
// 0x5B0CB680
struct FStructSerializerBuiltinTestStruct
{
	unsigned char                                      UnknownData00[0x5B0CB680];                                // 0x0000(0x5B0CB680) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerMapTestStruct
// 0x5B0AD540
struct FStructSerializerMapTestStruct
{
	unsigned char                                      UnknownData00[0x5B0AD540];                                // 0x0000(0x5B0AD540) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerArrayTestStruct
// 0x5B096640
struct FStructSerializerArrayTestStruct
{
	unsigned char                                      UnknownData00[0x5B096640];                                // 0x0000(0x5B096640) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerObjectTestStruct
// 0x5B096460
struct FStructSerializerObjectTestStruct
{
	unsigned char                                      UnknownData00[0x5B096460];                                // 0x0000(0x5B096460) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerBooleanTestStruct
// 0x5B0CE580
struct FStructSerializerBooleanTestStruct
{
	unsigned char                                      UnknownData00[0x5B0CE580];                                // 0x0000(0x5B0CE580) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerNumericTestStruct
// 0x5B0CE000
struct FStructSerializerNumericTestStruct
{
	unsigned char                                      UnknownData00[0x5B0CE000];                                // 0x0000(0x5B0CE000) MISSED OFFSET
};

// ScriptStruct Serialization.StructSerializerByteArray
// 0x5B0CDD80
struct FStructSerializerByteArray
{
	unsigned char                                      UnknownData00[0x5B0CDD80];                                // 0x0000(0x5B0CDD80) MISSED OFFSET
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
